betaflight/betaflight/lib/main/CH32H41x/middlewares/ch32h41x_hs/usb_ch32h41x_usbhs_reg.h
/*
 * Copyright (c) 2024, sakumisu
 *
 * SPDX-License-Identifier: Apache-2.0
 */
#pragma once

/**********************************/
/*********USB high speed**********/
/**********************************/
typedef volatile unsigned short *PUINT16V;
typedef volatile unsigned long *PUINT32V;
typedef volatile unsigned char *PUINT8V;

/* USB high speed device register */
#define R8_USB_CTRL             (*((PUINT8V)0x40030000)) // RW, USB_high_speed control register
#define USBHS_UD_LPM_EN         0x80                     // RW, enable LPM
#define USBHS_UD_DEV_EN         0x20                     // RW, enable USB equipment
#define USBHS_UD_DMA_EN         0x10                     // RW, enable DMA transmit
#define USBHS_UD_PHY_SUSPENDM   0x08                     // RW, suspeng USB PHY
#define USBHS_UD_CLR_ALL        0x04                     // RW, clear all interupt flag
#define USBHS_UD_RST_SIE        0x02                     // RW, reset USB protocol processor,including end point register
#define USBHS_UD_RST_LINK       0x01                     // RW, enable LNK layer reset
#define R8_USB_BASE_MODE        (*((PUINT8V)0x40030001)) // RW, USB_high_speed mode control register
#define USBHS_UD_SPEED_FULL     0x00
#define USBHS_UD_SPEED_HIGH     0x01
#define USBHS_UD_SPEED_LOW      0x02
#define USBHS_UD_SPEED_TYPE     0x03                      // RW, speed mode excpeted by the equipment,00:full speed, 01:high speed, 10:low speed
#define R8_USB_INT_EN           (*((PUINT8V)0x40030002))  // RW, USB_high_speed intreurpt enable register
#define USBHS_UDIE_FIFO_OVER    0x80                      // RW, enable fifo overflow interupt
#define USBHS_UDIE_LINK_RDY     0x40                      // RW, enable USB conect interupt
#define USBHS_UDIE_SOF_ACT      0x20                      // RW, enable SOF package received interupt
#define USBHS_UDIE_TRANSFER     0x10                      // RW, enable USB transmit end interupt
#define USBHS_UDIE_LPM_ACT      0x08                      // RW, enable lpm transmit end interupt
#define USBHS_UDIE_BUS_SLEEP    0x04                      // RW, enable usb bus sleep interupt
#define USBHS_UDIE_SUSPEND      0x02                      // RW, enable usb bus suspend interupt
#define USBHS_UDIE_BUS_RST      0x01                      // RW, enable usb bus reset interupt
#define R8_USB_DEV_AD           (*((PUINT8V)0x40030003))  // RW, USB_high_speed device adress register
#define USBHS_UD_DEV_ADDR       0x7F                      // RW, adress of usb equipment
#define R8_USB_WAKE_CTRL        (*((PUINT8V)0x40030004))  // RW, USB_high_speed wake up remotely register
#define USBHS_UD_UD_REMOTE_WKUP 0x01                      // RW1, wake up remotely and auto reset hardware
#define R8_USB_TEST_MODE        (*((PUINT8V)0x40030005))  // RW, USB_high_speed test mode register
#define USBHS_UD_TEST_EN        0x80                      // RW, enable test mode
#define USBHS_UD_TEST_SE0NAK    0x08                      // RW, output SE0 when in test mode
#define USBHS_UD_TEST_PKT       0x04                      // RW, output one package(including DATA0,data and length of end pont4) when in test mode,not work on virtual equipment
#define USBHS_UD_TEST_K         0x02                      // RW, output K when in test mode
#define USBHS_UD_TEST_J         0x01                      // RW, output J when in test mode
#define R16_USB_LPM_DATA        (*((PUINT16V)0x40030006)) // RW, USB_high_speed power control register
#define USBHS_UD_LPM_BUSY       0x8000                    // RW, power control busy
#define USBHS_UD_LPM_DATA       0x07FF                    // RO, power control data
#define R8_USB_INT_FG           (*((PUINT8V)0x40030008))  // RW, USB_high_speed interupt flag register
#define USBHS_UDIF_FIFO_OV      0x80                      // RW1, clear fifo overflow interupt flag
#define USBHS_UDIF_LINK_RDY     0x40                      // RW1, clear USB conect interupt flag
#define USBHS_UDIF_RX_SOF       0x20                      // RW1, clear SOF package received interupt flag
#define USBHS_UDIF_TRANSFER     0x10                      // RO,  USB transmit end interupt flag,cleared by USBHS_UDMS_HS_MOD
#define USBHS_UDIF_LPM_ACT      0x08                      // RW1, clear lpm transmit end interupt flag
#define USBHS_UDIF_BUS_SLEEP    0x04                      // RW1, clear usb bus sleep interupt flag
#define USBHS_UDIF_SUSPEND      0x02                      // RW1, clear usb bus suspend interupt flag
#define USBHS_UDIF_BUS_RST      0x01                      // RW1, clear usb bus reset interupt flag
#define R8_USB_INT_ST           (*((PUINT8V)0x40030009))  // RW, USB_high_speed interupt status register
#define USBHS_UDIS_EP_DIR       0x10                      // RO, end point tranfer diector of data
#define USBHS_UDIS_EP_ID_MASK   0x07                      // RO, number of end point which data transmission occured
#define R8_USB_MIS_ST           (*((PUINT8V)0x4003000A))  // RW, USB_high_speed miscellaneous register
#define USBHS_UDMS_HS_MOD       0x80                      // RO, host with high speed
#define USBHS_UDMS_SUSP_REQ     0x10                      // RO, requirment of suspending USB
#define USBHS_UDMS_SIE_FREE     0x08                      // RO, USB free state
#define USBHS_UDMS_SLEEP        0x04                      // RO, USB sleep state
#define USBHS_UDMS_SUSPEND      0x02                      // RO, USB in suspend state
#define USBHS_UDMS_READY        0x01                      // RO, USB in connected state
#define R16_USB_FRAME_NO        (*((PUINT16V)0x4003000C)) // RW, USB_high_speed frame number register
#define USBHS_UD_MFRAME_NO      0xE000
#define USBHS_UD_FRAME_NO       0x07FF
#define R16_USB_BUS             (*((PUINT16V)0x4003000E)) // RW, USB_high_speed bus status register
#define USBHS_USB_DM_ST         0x08
#define USBHS_USB_DP_ST         0x04
#define USB_WAKEUP              0x01
#define R16_UEP_TX_EN           (*((PUINT16V)0x40030010)) // RW, USB_high_speed end point transmit enable register
/* Bit definition for R16_U2EP_TX_EN & R16_U2EP_RX_EN register */
#define RB_EP0_EN  0x0001
#define RB_EP1_EN  0x0002
#define RB_EP2_EN  0x0004
#define RB_EP3_EN  0x0008
#define RB_EP4_EN  0x0010
#define RB_EP5_EN  0x0020
#define RB_EP6_EN  0x0040
#define RB_EP7_EN  0x0080
#define RB_EP8_EN  0x0100
#define RB_EP9_EN  0x0200
#define RB_EP10_EN 0x0400
#define RB_EP11_EN 0x0800
#define RB_EP12_EN 0x1000
#define RB_EP13_EN 0x2000
#define RB_EP14_EN 0x4000
#define RB_EP15_EN 0x8000

