betaflight/betaflight/lib/main/CH32H41x/middlewares/ch32h41x_hs/usb_ch32h41x_usbhs_reg.h
#define R16_UEP_RX_EN         (*((PUINT16V)0x40030012)) // RW, USB_high_speed end point receive enableregister
#define USBHS_UEP_RX_EN        0xFFFF
#define R16_UEP_T_TOG_AUTO    (*((PUINT16V)0x40030014)) // RW, USB_high_speed end point transmit auto toggle enable register
#define USBHS_UEP_T_TOG_AUTO   0xFF
#define R16_UEP_R_TOG_AUTO    (*((PUINT16V)0x40030016)) // RW, USB_high_speed end point receive auto toggle enable register
#define USBHS_UEP_R_TOG_AUTO   0xFF
#define R8_UEP_T_BURST        (*((PUINT8V)0x40030018)) // RW, USB_high_speed end point transmit burst register
#define USBHS_UEP_T_BURST_EN   0xFF
#define R8_UEP_T_BURST_MODE   (*((PUINT8V)0x40030019)) // RW, USB_high_speed end point transmit burst mode register
#define USBHS_UEP_T_BURST_MODE 0xFF
#define R8_UEP_R_BURST        (*((PUINT8V)0x4003001A)) // RW, USB_high_speed end point receive burst register
#define USBHS_UEP_R_BURST_EN   0xFF
#define R8_UEP_R_RES_MODE     (*((PUINT8V)0x4003001B)) // RW, USB_high_speed end point transmit reply mode register
#define USBHS_UEP_R_RES_MODE   0xFF
#define R32_UEP_AF_MODE       (*((PUINT32V)0x4003001C)) // RW, USB_high_speed end point multiplexing register
#define USBHS_UEP_T_AF         0xFE

#define R32_UEP0_DMA          (*((PUINT32V)0x40030020)) // RW, USB_high_speed end point0 begin adress of DMA buffer register
#define UEPn_DMA               0xFFFFFF
#define R32_UEP1_RX_DMA       (*((PUINT32V)0x40030024)) // RW, USB_high_speed end point1 begin adress of DMA receive buffer register
#define R32_UEP2_RX_DMA       (*((PUINT32V)0x40030028)) // RW, USB_high_speed end point2 begin adress of DMA receive buffer register
#define R32_UEP3_RX_DMA       (*((PUINT32V)0x4003002C)) // RW, USB_high_speed end point3 begin adress of DMA receive buffer register
#define R32_UEP4_RX_DMA       (*((PUINT32V)0x40030030)) // RW, USB_high_speed end point4 begin adress of DMA receive buffer register
#define R32_UEP5_RX_DMA       (*((PUINT32V)0x40030034)) // RW, USB_high_speed end point5 begin adress of DMA receive buffer register
#define R32_UEP6_RX_DMA       (*((PUINT32V)0x40030038)) // RW, USB_high_speed end point6 begin adress of DMA receive buffer register
#define R32_UEP7_RX_DMA       (*((PUINT32V)0x4003003C)) // RW, USB_high_speed end point7 begin adress of DMA receive buffer register
#define UEPn_RX_DMA            0xFFFFFF
#define R32_UEP1_TX_DMA       (*((PUINT32V)0x40030040)) // RW, USB_high_speed end point1 begin adress of DMA transmit buffer register
#define R32_UEP2_TX_DMA       (*((PUINT32V)0x40030044)) // RW, USB_high_speed end point2 begin adress of DMA transmit buffer register
#define R32_UEP3_TX_DMA       (*((PUINT32V)0x40030048)) // RW, USB_high_speed end point3 begin adress of DMA transmit buffer register
#define R32_UEP4_TX_DMA       (*((PUINT32V)0x4003004C)) // RW, USB_high_speed end point4 begin adress of DMA transmit buffer register
#define R32_UEP5_TX_DMA       (*((PUINT32V)0x40030050)) // RW, USB_high_speed end point5 begin adress of DMA transmit buffer register
#define R32_UEP6_TX_DMA       (*((PUINT32V)0x40030054)) // RW, USB_high_speed end point6 begin adress of DMA transmit buffer register
#define R32_UEP7_TX_DMA       (*((PUINT32V)0x40030058)) // RW, USB_high_speed end point7 begin adress of DMA transmit buffer register
#define UEPn_TX_DMA            0xFFFFFF

#define R32_UEP0_MAX_LEN      (*((PUINT32V)0x4003005C)) // RW, USB_high_speed end point0 max length package register
#define R32_UEP1_MAX_LEN      (*((PUINT32V)0x40030060)) // RW, USB_high_speed end point1 max length package register
#define R32_UEP2_MAX_LEN      (*((PUINT32V)0x40030064)) // RW, USB_high_speed end point2 max length package register
#define R32_UEP3_MAX_LEN      (*((PUINT32V)0x40030068)) // RW, USB_high_speed end point3 max length package register
#define R32_UEP4_MAX_LEN      (*((PUINT32V)0x4003006C)) // RW, USB_high_speed end point4 max length package register
#define R32_UEP5_MAX_LEN      (*((PUINT32V)0x40030070)) // RW, USB_high_speed end point5 max length package register
#define R32_UEP6_MAX_LEN      (*((PUINT32V)0x40030074)) // RW, USB_high_speed end point6 max length package register
#define R32_UEP7_MAX_LEN      (*((PUINT32V)0x40030078)) // RW, USB_high_speed end point7 max length package register
#define UEPn_MAX_LEN           0x007F

#define R16_UEP0_RX_LEN       (*((PUINT16V)0x4003007C)) // RW, USB_high_speed end point0 length of receive register
#define UEP0_RX_LEN            0x007F
#define R16_UEP1_RX_LEN       (*((PUINT16V)0x40030080)) // RW, USB_high_speed end point1 single received length register
#define R16_UEP1_R_SIZE       (*((PUINT16V)0x40030082)) // RW, USB_high_speed end point1 total received length register
#define R16_UEP2_RX_LEN       (*((PUINT16V)0x40030084)) // RW, USB_high_speed end point2 single received length register
#define R16_UEP2_R_SIZE       (*((PUINT16V)0x40030086)) // RW, USB_high_speed end point2 total received length register
#define R16_UEP3_RX_LEN       (*((PUINT16V)0x40030088)) // RW, USB_high_speed end point3 single received length register
#define R16_UEP3_R_SIZE       (*((PUINT16V)0x4003008A)) // RW, USB_high_speed end point3 total received length register
#define R16_UEP4_RX_LEN       (*((PUINT16V)0x4003008C)) // RW, USB_high_speed end point4 single received length register
#define R16_UEP4_R_SIZE       (*((PUINT16V)0x4003008E)) // RW, USB_high_speed end point4 total received length register
#define R16_UEP5_RX_LEN       (*((PUINT16V)0x40030090)) // RW, USB_high_speed end point5 single received length register
#define R16_UEP5_R_SIZE       (*((PUINT16V)0x40030092)) // RW, USB_high_speed end point5 total received length register
#define R16_UEP6_RX_LEN       (*((PUINT16V)0x40030094)) // RW, USB_high_speed end point6 single received length register
#define R16_UEP6_R_SIZE       (*((PUINT16V)0x40030096)) // RW, USB_high_speed end point6 total received length register
#define R16_UEP7_RX_LEN       (*((PUINT16V)0x40030098)) // RW, USB_high_speed end point7 single received length register
#define R16_UEP7_R_SIZE       (*((PUINT16V)0x4003009A)) // RW, USB_high_speed end point7 total received length register
#define UEPn_RX_LEN            0xFFFF
#define UEPn_R_SIZE            0xFFFF

#define R16_UEP0_T_LEN        (*((PUINT16V)0x4003009C)) // RW, USB_high_speed end point0 length of transmission register
#define UEP0_T_LEN             0x7F
#define R8_UEP0_TX_CTRL       (*((PUINT8V)0x4003009E))  // RW, USB_high_speed end point0 transmit control register
#define R8_UEP0_RX_CTRL       (*((PUINT8V)0x4003009F))  // RW, USB_high_speed end point0 receive control register

#define R16_UEP1_T_LEN       (*((PUINT16V)0x400300A0)) // RW, USB_high_speed end point1 length of transmission register
#define R8_UEP1_TX_CTRL       (*((PUINT8V)0x400300A2))  // RW, USB_high_speed end point1 transmit control register
#define R8_UEP1_RX_CTRL       (*((PUINT8V)0x400300A3))  // RW, USB_high_speed end point1 receive control register
#define R16_UEP2_T_LEN       (*((PUINT16V)0x400300A4)) // RW, USB_high_speed end point2 length of transmission register
#define R8_UEP2_TX_CTRL       (*((PUINT8V)0x400300A6))  // RW, USB_high_speed end point2 transmit control register
#define R8_UEP2_RX_CTRL       (*((PUINT8V)0x400300A7))  // RW, USB_high_speed end point2 receive control register
#define R16_UEP3_T_LEN       (*((PUINT16V)0x400300A8)) // RW, USB_high_speed end point3 length of transmission register
#define R8_UEP3_TX_CTRL       (*((PUINT8V)0x400300AA))  // RW, USB_high_speed end point3 transmit control register
#define R8_UEP3_RX_CTRL       (*((PUINT8V)0x400300AB))  // RW, USB_high_speed end point3 receive control register
#define R16_UEP4_T_LEN       (*((PUINT16V)0x400300AC)) // RW, USB_high_speed end point4 length of transmission register
#define R8_UEP4_TX_CTRL       (*((PUINT8V)0x400300AE))  // RW, USB_high_speed end point4 transmit control register
#define R8_UEP4_RX_CTRL       (*((PUINT8V)0x400300AF))  // RW, USB_high_speed end point4 receive control register
#define R16_UEP5_T_LEN       (*((PUINT16V)0x400300B0)) // RW, USB_high_speed end point5 length of transmission register
#define R8_UEP5_TX_CTRL       (*((PUINT8V)0x400300B2))  // RW, USB_high_speed end point5 transmit control register
#define R8_UEP5_RX_CTRL       (*((PUINT8V)0x400300B3))  // RW, USB_high_speed end point5 receive control register
#define R16_UEP6_T_LEN       (*((PUINT16V)0x400300B4)) // RW, USB_high_speed end point6 length of transmission register
#define R8_UEP6_TX_CTRL       (*((PUINT8V)0x400300B6))  // RW, USB_high_speed end point6 transmit control register
#define R8_UEP6_RX_CTRL       (*((PUINT8V)0x400300B7))  // RW, USB_high_speed end point6 receive control register
#define R16_UEP7_T_LEN       (*((PUINT16V)0x400300B8)) // RW, USB_high_speed end point7 length of transmission register
#define R8_UEP7_TX_CTRL       (*((PUINT8V)0x400300BA))  // RW, USB_high_speed end point7 transmit control register
#define R8_UEP7_RX_CTRL       (*((PUINT8V)0x400300BB))  // RW, USB_high_speed end point7 receive control register
/**R16_UEPn_T_LEN**/
#define UEPn_T_LEN 0xFFFF
/**R8_UEPn_TX_CTRL**/
#define USBHS_UEP_T_DONE      0x80
#define USBHS_UEP_T_NAK_ACT   0x40
#define USBHS_UEP_T_TOG_MASK  0x0C
#define USBHS_UEP_T_TOG_MDATA 0x0C
#define USBHS_UEP_T_TOG_DATA2 0x08
#define USBHS_UEP_T_TOG_DATA1 0x04
#define USBHS_UEP_T_TOG_DATA0 0x00
#define USBHS_UEP_T_RES_MASK  0x03
#define USBHS_UEP_T_RES_ACK   0x02
#define USBHS_UEP_T_RES_STALL 0x01
#define USBHS_UEP_T_RES_NAK   0x00

/**R8_UEPn_RX_CTRL**/
#define USBHS_UEP_R_DONE      0x80
#define USBHS_UEP_R_NAK_ACT   0x40
#define USBHS_UEP_R_NAK_TOG   0x20
#define USBHS_UEP_R_TOG_MATCH 0x10
#define USBHS_UEP_R_SETUP_IS  0x08
#define USBHS_UEP_R_TOG_MASK  0x0C
#define USBHS_UEP_R_TOG_MDATA 0x0C
#define USBHS_UEP_R_TOG_DATA2 0x08
#define USBHS_UEP_R_TOG_DATA1 0x04
#define USBHS_UEP_R_TOG_DATA0 0x00
#define USBHS_UEP_R_RES_MASK  0x03
#define USBHS_UEP_R_RES_ACK   0x02
#define USBHS_UEP_R_RES_STALL 0x01
#define USBHS_UEP_R_RES_NAK   0x00

#define R16_UEP_T_ISO      (*((PUINT16V)0x400300BC)) // RW, USB_high_speed end point transmit sync mode register
#define USBHS_UEP1_T_ISO_EN 0x02
#define USBHS_UEP2_T_ISO_EN 0x04
#define USBHS_UEP3_T_ISO_EN 0x08
#define USBHS_UEP4_T_ISO_EN 0x10
#define USBHS_UEP5_T_ISO_EN 0x20
#define USBHS_UEP6_T_ISO_EN 0x40
#define USBHS_UEP7_T_ISO_EN 0x80
#define R16_UEP_R_ISO      (*((PUINT16V)0x400300BE)) // RW, USB_high_speed end point receive sync mode register
#define USBHS_UEP1_R_ISO_EN 0x02
#define USBHS_UEP2_R_ISO_EN 0x04
#define USBHS_UEP3_R_ISO_EN 0x08
#define USBHS_UEP4_R_ISO_EN 0x10
#define USBHS_UEP5_R_ISO_EN 0x20
#define USBHS_UEP6_R_ISO_EN 0x40
#define USBHS_UEP7_R_ISO_EN 0x80

#define R32_UEP1_RX_FIFO   (*((PUINT32V)0x400300C0))  
#define R32_UEP2_RX_FIFO   (*((PUINT32V)0x400300C4))  
#define R32_UEP3_RX_FIFO   (*((PUINT32V)0x400300C8))  
#define R32_UEP4_RX_FIFO   (*((PUINT32V)0x400300CC))  
#define R32_UEP5_RX_FIFO   (*((PUINT32V)0x400300D0))  
#define R32_UEP6_RX_FIFO   (*((PUINT32V)0x400300D4))  
#define R32_UEP7_RX_FIFO   (*((PUINT32V)0x400300D8))  
#define RB_UEPn_RX_FIFO_END_ADDR   0xFFFF0000
#define RB_UEPn_RX_FIFO_START_ADDR   0x0000FFFF

#define R32_UEP1_TX_FIFO   (*((PUINT32V)0x400300DC))  
#define R32_UEP2_TX_FIFO   (*((PUINT32V)0x400300E0))  
#define R32_UEP3_TX_FIFO   (*((PUINT32V)0x400300E4))  
#define R32_UEP4_TX_FIFO   (*((PUINT32V)0x400300E8))  
#define R32_UEP5_TX_FIFO   (*((PUINT32V)0x400300EC))  
#define R32_UEP6_TX_FIFO   (*((PUINT32V)0x400300F0))  
#define R32_UEP7_TX_FIFO   (*((PUINT32V)0x400300F4)) 
#define RB_UEPn_TX_FIFO_END_ADDR   0xFFFF0000
#define RB_UEPn_TX_FIFO_START_ADDR   0x0000FFFF

/* USB high speed host register  */
#define R8_UH_CFG            (*((PUINT8V)0x40030100)) // RW, USB_high_speed register
#define USBHS_UH_LPM_EN       0x80
#define USBHS_UH_FORCE_FS     0x40
#define USBHS_UH_SOF_EN       0x20
#define USBHS_UH_DMA_EN       0x10
#define USBHS_UH_PHY_SUSPENDM 0x08
#define USBHS_UH_CLR_ALL      0x04
#define USBHS_RST_SIE         0x02
#define USBHS_RST_LINK        0x01
#define R8_UH_INT_EN          (*((PUINT8V)0x40030102)) // RW, USB_high_speed register
#define USBHS_UHIE_FIFO_OVER  0x80
#define USBHS_UHIE_TX_HALT    0x40
#define USBHS_UHIE_SOF_ACT    0x20
#define USBHS_UHIE_TRANSFER   0x10
#define USBHS_UHIE_RESUME_ACT 0x08
#define USBHS_UHIE_WKUP_ACT   0x04
#define R8_UH_DEV_AD         (*((PUINT8V)0x40030103)) // RW, USB_high_speed register
#define USBHS_UH_DEV_ADDR     0xFF
#define R32_UH_CONTROL       (*((PUINT32V)0x40030104)) // RW, USB_high_speed register
#define USBHS_UH_RX_NO_RES    0x800000
#define USBHS_UH_TX_NO_RES    0x400000
#define USBHS_UH_RX_NO_DATA   0x200000
#define USBHS_UH_TX_NO_DATA   0x100000
#define USBHS_UH_PRE_PID_EN   0x080000
#define USBHS_UH_SPLIT_VALID  0x040000
#define USBHS_UH_LPM_VALID    0x020000
#define USBHS_UH_HOST_ACTION  0x010000
#define USBHS_UH_BUF_MODE     0x0400
#define USBHS_UH_T_TOG_MASK   0x0300
#define USBHS_UH_T_TOG_MDATA  0x0300
#define USBHS_UH_T_TOG_DATA2  0x0200
#define USBHS_UH_T_TOG_DATA1  0x0100
#define USBHS_UH_T_TOG_DATA0  0x0000
#define USBHS_UH_T_ENDP_MASK  0xF0
#define USBHS_UH_T_TOKEN_MASK 0x0F

#define R8_UH_INT_FLAG            (*((PUINT8V)0x40030108)) // RW, USB_high_speed register
#define USBHS_UHIF_FIFO_OVER       0x80
#define USBHS_UHIF_TX_HALT         0x40
#define USBHS_UHIF_SOF_ACT         0x20
#define USBHS_UHIF_TRANSFER        0x10
#define USBHS_UHIF_RESUME_ACT      0x08
#define USBHS_UHIF_WKUP_ACT        0x04
#define R8_UH_INT_ST              (*((PUINT8V)0x40030109)) // RW, USB_high_speed register
#define USBHS_UHIF_PORT_RX_RESUME  0x10
#define USBHS_UH_R_TOKEN_MASK      0x0F
#define R8_UH_MIS_ST              (*((PUINT8V)0x4003010A)) // RW, USB_high_speed register
#define USBHS_UHMS_BUS_SE0         0x80
#define USBHS_UHMS_BUS_J           0x40
#define USBHS_UHMS_LINESTATE       0x30
#define USBHS_UHMS_USB_WAKEUP      0x08
#define USBHS_UHMS_SOF_ACT         0x04
#define USBHS_UHMS_SOF_PRE         0x02
#define USBHS_UHMS_SOF_FREE        0x01
#define R32_UH_LPM_DATA           (*((PUINT32V)0x4003010C)) // RW, USB_high_speed register
#define USBHS_UH_LPM_DATA          0x07FF
#define R32_UH_SPLIT_DATA         (*((PUINT32V)0x40030110)) // RW, USB_high_speed register
#define USBHS_UH_SPLIT_DATA        0x07FFFF
#define R32_UH_FRAME              (*((PUINT32V)0x40030114)) // RW, USB_high_speed register
#define USBHS_UH_SOF_CNT_CLR       0x02000000
#define USBHS_UH_SOF_CNT_EN        0x01000000
#define USBHS_UH_MFRAME_NO         0x070000
#define USBHS_UH_FRAME_NO          0x07FF
#define R32_UH_TX_LEN             (*((PUINT32V)0x40030118)) // RW, USB_high_speed register
#define USBHS_UH_TX_LEN            0x07FF
#define R32_UH_RX_LEN             (*((PUINT32V)0x4003011C)) // RW, USB_high_speed register
#define USBHS_UH_RX_LEN            0x07FF
#define R32_UH_RX_MAX_LEN         (*((PUINT32V)0x40030120)) // RW, USB_high_speed register
#define USBHS_UH_RX_MAX_LEN        0x07FF
#define R32_UH_RX_DMA             (*((PUINT32V)0x40030124)) // RW, USB_high_speed register
#define USBHS_R32_UH_RX_DMA        0x01FFFF
#define R32_UH_TX_DMA             (*((PUINT32V)0x40030128)) // RW, USB_high_speed register
#define USBHS_R32_UH_TX_DMA        0x01FFFF
#define R32_UH_PORT_CTRL          (*((PUINT32V)0x4003012C)) // RW, USB_high_speed register
#define USBHS_UH_BUS_RST_LONG      0x010000
#define USBHS_UH_PORT_SLEEP_BESL   0xF000
#define USBHS_UH_CLR_PORT_SLEEP    0x0100
#define USBHS_UH_CLR_PORT_CONNECT  0x20
#define USBHS_UH_CLR_PORT_EN       0x10
#define USBHS_UH_SET_PORT_SLEEP    0x08
#define USBHS_UH_CLR_PORT_SUSP     0x04
#define USBHS_UH_SET_PORT_SUSP     0x02
#define USBHS_UH_SET_PORT_RESET    0x01
#define R8_UH_PORT_CFG            (*((PUINT8V)0x40030130)) // RW, USB_high_speed register
#define USBHS_UH_PD_EN             0x80
#define USBHS_UH_HOST_EN           0x01
#define R8_UH_PORT_INT_EN         (*((PUINT8V)0x40030132)) // RW, USB_high_speed register
#define USBHS_UHIE_PORT_SLP        0x20
#define USBHS_UHIE_PORT_RESET      0x10
#define USBHS_UHIE_PORT_SUSP       0x04
#define USBHS_UHIE_PORT_EN         0x02
#define USBHS_UHIE_PORT_CONNECT    0x01
#define R8_UH_PORT_TEST_CT        (*((PUINT8V)0x40030133)) // RW, USB_high_speed register
#define USBHS_UH_TEST_FORCE_EN     0x04
#define USBHS_UH_TEST_K            0x02
#define USBHS_UH_TEST_J            0x01
#define R16_UH_PORT_ST            (*((PUINT16V)0x40030134)) // RW, USB_high_speed register
#define USBHS_UHIS_PORT_TEST       0x0800
#define USBHS_UHIS_PORT_SPEED_MASK 0x0600
#define USBHS_UHIS_PORT_HS         0x0400
#define USBHS_UHIS_PORT_LS         0x0200
#define USBHS_UHIS_PORT_FS         0x0000
#define USBHS_UHIS_PORT_SLP        0x20
#define USBHS_UHIS_PORT_RST        0x10
#define USBHS_UHIS_PORT_SUSP       0x04
#define USBHS_UHIS_PORT_EN         0x02
#define USBHS_UHIS_PORT_CONNECT    0x01
#define R8_UH_PORT_CHG            (*((PUINT8V)0x40030136))
#define USBHS_UHIF_PORT_SLP        0x20
#define USBHS_UHIF_PORT_RESET      0x10
#define USBHS_UHIF_PORT_SUSP       0x04
#define USBHS_UHIF_PORT_EN         0x02
#define USBHS_UHIF_PORT_CONNECT    0x01
#define R32_UH_BC_CTRL            (*((PUINT32V)0x4003013C))
#define UDM_VSRC_ACT               0x0400
#define UDM_BC_VSRC                0x0200
#define UDP_BC_VSRC                0x0100
#define BC_AUTO_MODE               0x40
#define UDM_BC_CMPE                0x20
#define UDP_BC_CMPE                0x10
#define UDM_BC_CMPO                0x02
#define UDP_BC_CMPO                0x01


#define __IO volatile /* defines 'read / write' permissions */

#ifndef uint8_t 
typedef  unsigned char  uint8_t;
#endif

#ifndef uint16_t 
typedef  unsigned short int  uint16_t;
#endif

#ifndef uint32_t 
typedef  long unsigned int  uint32_t;
#endif


typedef struct
{
    __IO uint8_t CONTROL;     /* 0x40030000 */
    __IO uint8_t BASE_MODE;   /* 0x40030001 */
    __IO uint8_t INT_EN;      /* 0x40030002 */
    __IO uint8_t DEV_AD;      /* 0x40030003 */
    __IO uint8_t WAKE_CTRL;   /* 0x40030004 */
    __IO uint8_t TEST_MODE;   /* 0x40030005 */
    __IO uint16_t LPM_DATA;   /* 0x40030006 */

    __IO uint8_t INT_FG;      /* 0x40030008 */
    __IO uint8_t INT_ST;      /* 0x40030009 */
    __IO uint8_t MIS_ST;      /* 0x4003000a */
    __IO uint8_t RESERVE0;    /* 0x4003000b */

    __IO uint16_t FRAME_NO;   /* 0x4003000c */
    __IO uint16_t USB_BUS;    /* 0x4003000e */

