betaflight/betaflight/lib/main/CH32H41x/middlewares/ch32h41x_hs/usb_ch32h41x_usbhs_reg.h
    __IO uint16_t UEP_TX_EN;  /* 0x40030010 */
    __IO uint16_t UEP_RX_EN;  /* 0x40030012 */
    __IO uint16_t UEP_T_TOG_AUTO;  /* 0x40030014 */
    __IO uint16_t UEP_R_TOG_AUTO;  /* 0x40030016 */

    __IO uint8_t UEP_T_BURST;      /* 0x40030018 */
    __IO uint8_t UEP_T_BURST_MODE; /* 0x40030019 */
    __IO uint8_t UEP_R_BURST;      /* 0x4003001a */
    __IO uint8_t UEP_R_RES_MODE;   /* 0x4003001b */

    __IO uint32_t UEP_AF_MODE;     /* 0x4003001c */
    __IO uint32_t UEP0_DMA;    /* 0x40030020 */
    __IO uint32_t UEP1_RX_DMA; /* 0x40030024 */
    __IO uint32_t UEP2_RX_DMA; /* 0x40030028 */
    __IO uint32_t UEP3_RX_DMA; /* 0x4003002c */
    __IO uint32_t UEP4_RX_DMA; /* 0x40030030 */
    __IO uint32_t UEP5_RX_DMA; /* 0x40030034 */
    __IO uint32_t UEP6_RX_DMA; /* 0x40030038 */
    __IO uint32_t UEP7_RX_DMA; /* 0x4003003c */
    __IO uint32_t UEP1_TX_DMA; /* 0x40030040 */
    __IO uint32_t UEP2_TX_DMA; /* 0x40030044 */
    __IO uint32_t UEP3_TX_DMA; /* 0x40030048 */
    __IO uint32_t UEP4_TX_DMA; /* 0x4003004c */
    __IO uint32_t UEP5_TX_DMA; /* 0x40030050 */
    __IO uint32_t UEP6_TX_DMA; /* 0x40030054 */
    __IO uint32_t UEP7_TX_DMA; /* 0x40030058 */
    __IO uint32_t UEP0_MAX_LEN; /* 0x4003005c */
    __IO uint32_t UEP1_MAX_LEN; /* 0x40030060 */
    __IO uint32_t UEP2_MAX_LEN; /* 0x40030064 */
    __IO uint32_t UEP3_MAX_LEN; /* 0x40030068 */
    __IO uint32_t UEP4_MAX_LEN; /* 0x4003006c */
    __IO uint32_t UEP5_MAX_LEN; /* 0x40030070 */
    __IO uint32_t UEP6_MAX_LEN; /* 0x40030074 */
    __IO uint32_t UEP7_MAX_LEN; /* 0x40030078 */

    __IO uint16_t USB_EP0_RX_LEN; /* 0x4003007c */
    __IO uint16_t RESERVE1;       /* 0x4003007e */
    __IO uint16_t UEP1_RX_LEN;    /* 0x40030080 */
    __IO uint16_t UEP1_R_SIZE;    /* 0x40030082 */
    __IO uint16_t UEP2_RX_LEN;    /* 0x40030084 */
    __IO uint16_t UEP2_R_SIZE;    /* 0x40030086 */
    __IO uint16_t UEP3_RX_LEN;    /* 0x40030088 */
    __IO uint16_t UEP3_R_SIZE;    /* 0x4003008a */
    __IO uint16_t UEP4_RX_LEN;    /* 0x4003008c */
    __IO uint16_t UEP4_R_SIZE;    /* 0x4003008e */
    __IO uint16_t UEP5_RX_LEN;    /* 0x40030090 */
    __IO uint16_t UEP5_R_SIZE;    /* 0x40030092 */
    __IO uint16_t UEP6_RX_LEN;    /* 0x40030094 */
    __IO uint16_t UEP6_R_SIZE;    /* 0x40030096 */
    __IO uint16_t UEP7_RX_LEN;    /* 0x40030098 */
    __IO uint16_t UEP7_R_SIZE;    /* 0x4003009a */

    __IO uint16_t UEP0_TX_LEN; /* 0x4003009c */
    __IO uint8_t UEP0_TX_CTRL; /* 0x4003009e */
    __IO uint8_t UEP0_RX_CTRL; /* 0x4003009f */
    __IO uint16_t UEP1_TX_LEN; /* 0x400300a0 */
    __IO uint8_t UEP1_TX_CTRL; /* 0x400300a2 */
    __IO uint8_t UEP1_RX_CTRL; /* 0x400300a3 */
    __IO uint16_t UEP2_TX_LEN; /* 0x400300a4 */
    __IO uint8_t UEP2_TX_CTRL; /* 0x400300a6 */
    __IO uint8_t UEP2_RX_CTRL; /* 0x400300a7 */
    __IO uint16_t UEP3_TX_LEN; /* 0x400300a8 */
    __IO uint8_t UEP3_TX_CTRL; /* 0x400300aa */
    __IO uint8_t UEP3_RX_CTRL; /* 0x400300ab */
    __IO uint16_t UEP4_TX_LEN; /* 0x400300ac */
    __IO uint8_t UEP4_TX_CTRL; /* 0x400300ae */
    __IO uint8_t UEP4_RX_CTRL; /* 0x400300af */
    __IO uint16_t UEP5_TX_LEN; /* 0x400300b0 */
    __IO uint8_t UEP5_TX_CTRL; /* 0x400300b2 */
    __IO uint8_t UEP5_RX_CTRL; /* 0x400300b3 */
    __IO uint16_t UEP6_TX_LEN; /* 0x400300b4 */
    __IO uint8_t UEP6_TX_CTRL; /* 0x400300b6 */
    __IO uint8_t UEP6_RX_CTRL; /* 0x400300b7 */
    __IO uint16_t UEP7_TX_LEN; /* 0x400300b8 */
    __IO uint8_t UEP7_TX_CTRL; /* 0x400300ba */
    __IO uint8_t UEP7_RX_CTRL; /* 0x400300bb */

    __IO uint16_t UEP_TX_ISO;  /* 0x400300bc */
    __IO uint16_t UEP_RX_ISO;  /* 0x400300be */

    __IO uint32_t UEP1_RX_FIFO; /* 0x400300C0 */
    __IO uint32_t UEP2_RX_FIFO; /* 0x400300C4 */
    __IO uint32_t UEP3_RX_FIFO; /* 0x400300C8 */
    __IO uint32_t UEP4_RX_FIFO; /* 0x400300CC */
    __IO uint32_t UEP5_RX_FIFO; /* 0x400300D0 */
    __IO uint32_t UEP6_RX_FIFO; /* 0x400300D4 */
    __IO uint32_t UEP7_RX_FIFO; /* 0x400300D8 */
    __IO uint32_t UEP1_TX_FIFO; /* 0x400300DC */
    __IO uint32_t UEP2_TX_FIFO; /* 0x400300E0 */
    __IO uint32_t UEP3_TX_FIFO; /* 0x400300E4 */
    __IO uint32_t UEP4_TX_FIFO; /* 0x400300E8 */
    __IO uint32_t UEP5_TX_FIFO; /* 0x400300EC */
    __IO uint32_t UEP6_TX_FIFO; /* 0x400300F0 */
    __IO uint32_t UEP7_TX_FIFO; /* 0x400300F4 */

} USBHSD_TypeDef;



/* USBHS Host Registers */
typedef struct  __attribute__((packed))
{
  __IO uint8_t  CFG;
  uint8_t  RESERVED0;
  __IO uint8_t  INT_EN;
  __IO uint8_t  DEV_ADDR;
  __IO uint32_t CONTROL;

  __IO uint8_t  INT_FLAG;
  __IO uint8_t  INT_ST;
  __IO uint8_t  MIS_ST;
  uint8_t  RESERVED1;

  __IO uint32_t LPM;
  __IO uint32_t SPLIT;
  __IO uint32_t FRAME;
  __IO uint32_t TX_LEN;
  __IO uint32_t RX_LEN;
  __IO uint32_t RX_MAX_LEN;
  __IO uint32_t RX_DMA;
  __IO uint32_t TX_DMA;
  __IO uint32_t PORT_CTRL;
  __IO uint8_t  PORT_CFG;
  uint8_t  RESERVED2;
  __IO uint8_t  PORT_INT_EN;
  __IO uint8_t  PORT_TEST_CT;

  __IO uint16_t PORT_STATUS;
  __IO uint8_t  PORT_STATUS_CHG;
  uint8_t  RESERVED3[5];
  __IO uint32_t ROOT_BC_CTRL;
} USBHSH_TypeDef;

typedef void (*usb_rxsof_handler_t)(void);

extern usb_rxsof_handler_t usb_rxsof_handler;


